Ракович_В_Ю_70189466/src/AccumulationRegisters/ВыдачаЛекарств/ВыдачаЛекарств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВыдачаЛекарств</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоДоз</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>DocumentRef.НазначениеЛекарств</types>
    </type>
  </attributes>
  <attributes>
    <name>Выдавший</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВыдачи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Лекарство</name>
    <type>
      <types>CatalogRef.Лекарства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Ракович_В_Ю_70189466/src/AccumulationRegisters/ВыдачаЛекарств/ManagerModule.bsl
// Получить историю выдачи лекарств студенту
Функция ПолучитьИсториюВыдачиЛекарств(Студент, ДатаНачала, ДатаОкончания) Экспорт
     
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    ВыдачаЛекарств.Период,
    |    ВыдачаЛекарств.Лекарство.Наименование,
    |    ВыдачаЛекарств.Количество,
    |    ВыдачаЛекарств.СпособВыдачи,
    |    ВыдачаЛекарств.Выдавший
    |ИЗ
    |    РегистрНакопления.ВыдачаЛекарств КАК ВыдачаЛекарств
    |ГДЕ
    |    ВыдачаЛекарств.Студент = &Студент
    |    И ВыдачаЛекарств.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
    |УПОРЯДОЧИТЬ ПО
    |    ВыдачаЛекарств.Период УБЫВ";
    
    Запрос.УстановитьПараметр("Студент", Студент);
    Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
    Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
    
    Возврат Запрос.Выполнить().Выгрузить();
    
КонецФункции

// Проверить остатки лекарств
Функция ПолучитьОстаткиЛекарств(НаДату) Экспорт
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    Лекарства.Наименование КАК Лекарство,
    |    Лекарства.ЕдиницаИзмерения,
    |    Лекарства.НормаОстатка,
    |    ВЫБОР
    |        КОГДА Лекарства.НормаОстатка > 0
    |            ТОГДА Лекарства.НормаОстатка - ВЫРАЗИТЬ(СУММА(ВыдачаЛекарств.Количество) КАК ЧИСЛО(15, 2))
    |        ИНАЧЕ 0
    |    КОНЕЦ КАК Остаток
    |ИЗ
    |    Справочник.Лекарства КАК Лекарства
    |        ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыдачаЛекарств КАК ВыдачаЛекарств
    |        ПО Лекарства.Ссылка = ВыдачаЛекарств.Лекарство
    |            И ВыдачаЛекарств.Период <= &НаДату
    |
    |СГРУППИРОВАТЬ ПО
    |    Лекарства.Наименование,
    |    Лекарства.ЕдиницаИзмерения,
    |    Лекарства.НормаОстатка
    |
    |ИМЕЮЩИЕ
    |    ВЫБОР
    |        КОГДА Лекарства.НормаОстатка > 0
    |            ТОГДА Лекарства.НормаОстатка - ВЫРАЗИТЬ(СУММА(ВыдачаЛекарств.Количество) КАК ЧИСЛО(15, 2))
    |        ИНАЧЕ 0
    |    КОНЕЦ < Лекарства.НормаОстатка * 0.2
    |
    |УПОРЯДОЧИТЬ ПО
    |    Остаток";
    
    Запрос.УстановитьПараметр("НаДату", НаДату);
    
    Возврат Запрос.Выполнить().Выгрузить();
    
КонецФункции
